In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv(r"E:\PYTHON\python Datasets\titanic.csv")

In [3]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [5]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [6]:
data.drop('deck',axis=1,inplace=True) #688 null values

In [7]:
data.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,Southampton,no,False

In [8]:
data.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
embark_town      3
alive            2
alone            2
dtype: int64

In [9]:
data.alive.unique()

array(['no', 'yes'], dtype=object)

In [10]:
data.survived.unique()

array([0, 1], dtype=int64)

In [11]:
data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [12]:
data.who.unique()

array(['man', 'woman', 'child'], dtype=object)

In [13]:
data["class"].unique()

array(['Third', 'First', 'Second'], dtype=object)

In [14]:
from sklearn.preprocessing import LabelEncoder                    #alone 0,1   = False,True
le=LabelEncoder()                                                 #class 0,1,2 = first,second,third
data[['who','class','alone']].apply(LabelEncoder().fit_transform) #who 0,1,2   =child,man,woman

     who  class  alone
0      1      2      0
1      2      0      0
2      2      2      1
3      2      0      0
4      1      2      1
..   ...    ...    ...
886    1      1      1
887    2      0      1
888    2      2      0
889    1      0      1
890    1      2      1

[891 rows x 3 columns]

In [15]:
data[['who','class','alone']]=data[['who','class','alone']].apply(LabelEncoder().fit_transform)

In [16]:
data.embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [17]:
data.embarked=le.fit_transform(data.embarked)

In [18]:
data.embarked.unique() # c,n,s,q=0,1,2,3

array([2, 0, 1, 3])

In [19]:
data.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,2,2,1,True,Southampton,no,0
1,1,1,female,38.0,1,0,71.2833,0,0,2,False,Cherbourg,yes,0

In [20]:
target=data['survived']

In [21]:
data[['embarked','class','who','alone']] #sex and who is same,alone and sibsp same,

     embarked  class  who  alone
0           2      2    1      0
1           0      0    2      0
2           2      2    2      1
3           2      0    2      0
4           2      2    1      1
..        ...    ...  ...    ...
886         2      1    1      1
887         2      0    2      1
888         2      2    2      0
889         0      0    1      1
890         1      2    1      1

[891 rows x 4 columns]

In [22]:
x=data[['embarked','class','who','alone']]

In [23]:
x.head()

   embarked  class  who  alone
0         2      2    1      0
1         0      0    2      0
2         2      2    2      1
3         2      0    2      0
4         2      2    1      1

In [24]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

# Train test split

In [26]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,target,test_size=.25,random_state=15)

In [27]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(668, 4)
(223, 4)
(668,)
(223,)

In [28]:
from sklearn.linear_model import LogisticRegression
titanic=LogisticRegression()

In [29]:
titanic.fit(x_train,y_train)

LogisticRegression()

In [31]:
y_pred=titanic.predict(x_test)

In [40]:
y_proba=titanic.predict_proba(x_test)

In [44]:
y_proba[:5]

array([[0.21386062, 0.78613938],
       [0.479074  , 0.520926  ],
       [0.56574243, 0.43425757],
       [0.29254923, 0.70745077],
       [0.82448284, 0.17551716]])

In [45]:
from sklearn.metrics import confusion_matrix

In [48]:
from sklearn.metrics import accuracy_score
ac=accuracy_score(y_test,y_pred)

In [50]:
ac

0.7085201793721974

In [51]:
cm=confusion_matrix(y_test,y_pred)

In [52]:
cm

array([[103,  24],
       [ 41,  55]], dtype=int64)